//ОГОЛОШЕННЯ ЗМІННОЇ

//Ключеве слово let для 
//оголошення змінної 

//Ім'я змінної може мати
//тільки букви, краще латинcьким
//алфавітом, цифри і символи
//$ і _. При цьому перший символ  
//не повинен бути цифрою


//Правильне оголошення
let age;
let ingo123;
let $size;
let _color;

//Неправильне оголошення 
//let 123info;
//let my-age;

// ПРИСВОЄННЯ ЗНАЧЕННЯ ЗМІННОЇ

//Оголошення значення змінної
let myLifeStyle;
//Присвоєння  значення 
myLifeStyle = "freelance";

//Оголошення змінної і присвоєння значень
let age1 = 15; 

//ОБЛАСТЬ БАЧЕНОСТІ ЗМІННИХ

//Баченість змінних тільки всередині блока інструкцій 
function testBlock(){
    let myAge = 36;
}
testBlock(); 

//console,log(myAge); Змінну не видно за межами блока 


//КОНСТАНТИ

const myAge = 15;
//myAge = 3; не можливо змінити константу, в цьому випадку буде помилка 


// КЛЮЧЕВЕ СЛОВО VAR

//Область баченості 
if(true) {
    let sizelet = 50;
}
//Змінну НЕ видно за межам блока
//console.log(sizeLet);
if(true) {
    var sizeVar = 50;
}  
//Змінну ВИДНО ЗА МЕЖАми блока 
console.log(sizeVar);

//ДОМАШКА
// 1) 
let colorEyes
// 2)
let user, userName;
userName = "Вася";
user = userName; 
console.log(user);

// 3) Варіант №1 
// let user1 = "Олег" let age = 36





