// КРАПКА З КОМОЮ 

console.log("Вчимо");
console.log("JS");

console.log("Вчимо")
console.log("JS")

console.log("Вчимо JS");
//["Вчимо","JS"].forEach(alert);
/*
ЗНАЧЕННЯ
В JavaScript є декільув типів значень (values):
фіксовані значення (літерали), значення констант і значення змінних.
*/
//Приклади літералів
25                             // літерал цілого числа
23.4                           // літерал дробового числа
'JavaScript'                   // літерал рядків
"JavaScript"                   // літерал рядків
[34, 45, 3]                    // літерал масива
{}                             // літерал об'єкта
{
    name: "BOBIK"
    surname: "BOBIKOVI4"
}                              // літерал об'єктва
//(ab || bc)                   // літерал регулярного вираження

// В мовах програмування константи і змінні 
// використовуються для зберігання значень даних.
const MAX_VALUE = 17;            // константа
var section = "JS";              // змінна
let arr = ["HTML","CSS","JS"]    // змінна 



/*
ОПЕРАТОРИ 
В JavaScript має дуже багато різних операторів 
Вони позначають операцію, яку потрібно зробити
*/
// Наприклад
// * / + - = і т.д
console.log("Вчимо" + "JS")

/*  
ВИРАЗИ
Вирази (expression) - це комбінація значень,
змінних і операторів, які присвоюють 
змінних значень чи повертають яке-небудь 
значення без його присвоювання
*/


//Приклади виразів
let num = 4; // Вираз присвоєння
console.log(num);
"Вчимо" + "JS"; // Вираз без присвоєння

/*
КЛЮЧОВІ СЛОВА
Інструкції JavaScript часто починають с ключового слова
(keyword). Воно (ключеве слово) призначено для того, щоб
визначити якусь дію JavaScript необхідно виконати.
*/ 

//Приклад ключового слова 
let num1 = "Вчимо JS"; // вказує браузеру створити змінну
console.log(num1);



/*
БЛОК ІНСТРУКЦІЙ 
JavaScript інструкція можна згрупувати за допомогою так
званного блока, по суті фігурні дужки {....}.
Як правило, використовується в функціях, циклах і так дальше.. 
*/

//Приклади блока інструкцій 
function name () {
    console.log("Вчимо");
    console.log("JS")
}
name()
/*
КОМЕНТАРІЙ 
Не всі інструкції JavaScript являються виконульними.
Код після двійних косих ліній // чи 
між / * і * / розгалядаються як коментарій  
*/
// Це коментарій 

/*
Це багаторядковий 
 коментар 
*/


/*
ПРОБІЛИ
Рекомендуються добавляти пробіли в інструкції,
щоб зробити код більш читальним чи красивішим.
JavaScript ігнорує декілька пробілів.
*/
// Наступні рядки еквіваленти: 
let str = "Text";
let str1="Text";

/* 
    Як правило пробіли прийнто
    розміщати коло операторів: =, +, -, * i /.
*/


/*
ДОВЖИНА РЯДКІВ
Для кращої читальності кода рекомендується уникати рядки
з довжиною більш 80 символів. Якщо JS інструкція має  
більшу довжину, то їй бажано розірвати.
В більшості випадків розрив інструкцій краще здійснити
після якого-небудь оператора.
*/
//Приклад 
document.getElementById("text").innerHTML = 
    " Текст для деякого поля ";

/* 
ДОМАШКА
Створи новий проєкт, підключи до нього файл scipt.js і
в строгому режимі виведи консоль фразу <<Я вчу JS >>

Також напиши в коментарій який варіант викличе помилку:
Варіант №3
*/




















